
Функция ШтрихкодИзDataMatrix(ДанныеШтрихкодов) Экспорт
	
	КоличествоШК = 1;
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Структура") И НЕ ДанныеШтрихкодов.Свойство("Количество", КоличествоШК) Тогда
		КоличествоШК = 1;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	Если МассивШтрихкодов.Количество() = 0 Тогда
		Возврат ДанныеШтрихкодов;
	КонецЕсли;
	
	Если ТипЗнч(МассивШтрихкодов[0]) = Тип("Структура") Тогда
		ШК = МассивШтрихкодов[0].Штрихкод;
	ИначеЕсли ТипЗнч(МассивШтрихкодов) = Тип("Строка") Тогда
		ШК = МассивШтрихкодов[0];
	Иначе
		ТекстОповещения = НСтр("ru = 'Не удалось разобрать сканированный штрихкод'");
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Ошибка чтения штрихкода'"),
			,
			ТекстОповещения,
			БиблиотекаКартинок.Предупреждение32);
		Возврат Неопределено;
	КонецЕсли;
		
	Если СтрДлина(ШК) < 31 И Найти(ШК, Символ(29)) = 0 Тогда
		Возврат ДанныеШтрихкодов;
	КонецЕсли;
	
	ШК = Лев(ШК, 31);
	ШК = СтрЗаменить(ШК, Символ(29), "");
	
	ПраваяЧасть = Прав(ШК, 29);
	Позиция21НаМесте = Сред(ПраваяЧасть, 15, 2) = "21";
	Если Позиция21НаМесте Тогда
		ШК = Лев(ПраваяЧасть, 14);
	Иначе
		ТекстОповещения = НСтр("ru = 'Не удалось распознать ШК в DataMatrix'");
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Ошибка чтения штрихкода'"),
			,
			ТекстОповещения,
			БиблиотекаКартинок.Предупреждение32);
		ШК = Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура("Штрихкод, Количество", ШК, КоличествоШК);	
	
КонецФункции